# Отчет об эксплуатации: Sudo weak configuration (Green Level/Easy)

## Цель
Повышение привилегий путем поиска команд, которые можно выполнить от лица пользователя более высокого уровня.

## Ход эксплуатации (Steps to Reproduce)

1. **Первичная разведка** В домашней папке пользователя был найден файл readme.md, в котором было написано что файл с паролем от целевого пользователя находится по пути /challenge/app-script/ch1cracked/.passwd. Однако доступа к нему мы не имеем.
2. **Поиск ключевых команд** Набрав sudo -l и введя пароль своего пользователя замечаем, что мы можем выполнять команду cat, но только от лица пользователя app-script-ch1-cracked и только по этому пути /challenge/app-script/ch1/notes/.
3. **Уточнение** Так как файл с паролем лежит не по этому пути, а на две директории выше. Чтобы подняться на две папки выше мы можем использовать Path Traversal используя путь /challenge/app-script/ch1/notes/../../ch1cracked/.passwd.
4. **Эксплуатация** Введем команду sudo -u app-script-ch1-cracked cat /challenge/app-script/ch1/notes/../../ch1cracked/.passwd | od -c. В выводе получаем содержимое файла с паролем пользователя app-script-ch1-cracked.

## Результат
Уязвимость подтверждена. "Эскалация привилегий" прошла успешно путем получения файла с паролем пользователя app-script-ch1-cracked.
